In [ ]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# Question 1.

Write an SQL query to display the names and salaries of employees
whose salary is greater than the average salary in the company.

Also explain how the subquery works.

# Table Create

In [ ]:
%%sql
CREATE TABLE employees (
    employee_name TEXT,
    salary INT,
    department TEXT,
    commission INT
);

 * sqlite://
Done.

[]

# Data Insert

In [ ]:
%%sql
INSERT INTO employees (employee_name, salary, department, commission) VALUES
('Amit', 30000, 'IT', NULL),
('Riya', 50000, 'HR', 5000),
('Rahul', 40000, 'IT', NULL),
('Neha', 60000, 'Finance', 7000),
('Karan', 35000, 'IT', NULL);

 * sqlite://
5 rows affected.

[]

In [ ]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

# Table Print

In [ ]:
%%sql
SELECT * FROM employees;

 * sqlite://
Done.

[('Amit', 30000, 'IT', None),
 ('Riya', 50000, 'HR', 5000),
 ('Rahul', 40000, 'IT', None),
 ('Neha', 60000, 'Finance', 7000),
 ('Karan', 35000, 'IT', None)]

# Final Query

In [ ]:
%%sql
SELECT employee_name, salary
FROM employees
WHERE salary > (
    SELECT AVG(salary)
    FROM employees
);

 * sqlite://
Done.

[('Riya', 50000), ('Neha', 60000)]

# Explanation

This query uses a subquery to compare each employee’s salary
with the average salary of the company.

## How the subquery works

1. The inner query:
   SELECT AVG(salary) FROM employees

   It calculates the average salary of all employees and returns a single value.

2. The outer query:
   SELECT employee_name, salary FROM employees
   WHERE salary > (average salary)

   It compares each employee’s salary with the average value.

3. Only employees whose salary is greater than the average
   are displayed.

# Question 2.

Write a query to retrieve the top 5 highest-paid employees from an employees table.

Explain how sorting affects the output.

In [ ]:
%%sql
SELECT employee_name, salary
FROM employees
ORDER BY salary DESC
LIMIT 5;

 * sqlite://
Done.

[('Neha', 60000),
 ('Riya', 50000),
 ('Rahul', 40000),
 ('Karan', 35000),
 ('Amit', 30000)]

# Explanation

This query retrieves the top 5 employees with the highest salaries.

## How sorting affects the output

1. ORDER BY salary DESC sorts the records in descending order,
   meaning the highest salaries appear first.

2. LIMIT 5 restricts the output to only the first 5 rows
   after sorting is applied.

3. Without sorting, the database would return rows in their
   default order, which may not correspond to the highest salaries.

## Execution Flow

Step 1 → Data is sorted by salary (highest to lowest)  
Step 2 → Only the first 5 records are returned

# Question 3.

Write a query to calculate:

• Total number of employees

• Average salary

• Minimum and maximum salary

Explain the difference between aggregate and scalar functions.

In [ ]:
%%sql
SELECT
    COUNT(*) AS total_employees,
    AVG(salary) AS average_salary,
    MIN(salary) AS minimum_salary,
    MAX(salary) AS maximum_salary
FROM employees;

 * sqlite://
Done.

[(5, 43000.0, 30000, 60000)]

# Explanation

This query uses aggregate functions to compute summary statistics
for the employees table.

• COUNT(*) → Calculates the total number of employees  
• AVG(salary) → Finds the average salary  
• MIN(salary) → Finds the lowest salary  
• MAX(salary) → Finds the highest salary  

All calculations are performed on the entire table.

# Difference Between Aggregate and Scalar Functions

## Aggregate Functions
Aggregate functions perform calculations on multiple rows
and return a single value.

Examples:
COUNT(), AVG(), SUM(), MIN(), MAX()

They are commonly used with GROUP BY or for summary statistics.

## Scalar Functions
Scalar functions operate on a single value
and return a single value.

Examples:
UPPER(), LOWER(), ROUND(), LENGTH()

They work row by row rather than across multiple rows.

# Question 4

Given a sales table with columns (region, amount), write a query to find
total sales per region.

Filter only those regions where total sales exceed 50,000.

In [ ]:
%%sql
DROP TABLE IF EXISTS sales;
CREATE TABLE sales (
    region TEXT,
    amount INT
);

 * sqlite://
Done.
Done.

[]

In [ ]:
%%sql
INSERT INTO sales (region, amount) VALUES
('North', 20000),
('North', 40000),
('South', 30000),
('South', 15000),
('East', 60000),
('West', 10000),
('West', 45000);

 * sqlite://
7 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM sales;

 * sqlite://
Done.

[('North', 20000),
 ('North', 40000),
 ('South', 30000),
 ('South', 15000),
 ('East', 60000),
 ('West', 10000),
 ('West', 45000),
 ('North', 20000),
 ('North', 40000),
 ('South', 30000),
 ('South', 15000),
 ('East', 60000),
 ('West', 10000),
 ('West', 45000)]

In [ ]:
%%sql
SELECT region, SUM(amount) AS total_sales
FROM sales
GROUP BY region
HAVING SUM(amount) > 50000;

 * sqlite://
Done.

[('East', 120000), ('North', 120000), ('South', 90000), ('West', 110000)]

# Explanation

This query calculates total sales for each region and filters
only those regions whose total sales exceed 50,000.

1. GROUP BY region groups the rows based on region.
2. SUM(amount) calculates the total sales for each region.
3. HAVING SUM(amount) > 50000 filters the grouped results.

HAVING is used instead of WHERE because it filters
after aggregation.

# Question 5.

Write a query to find the number of unique job roles in an employees table.

Explain why DISTINCT is necessary here.

In [ ]:
%%sql
SELECT COUNT(DISTINCT job_role) AS unique_roles
FROM employees;

 * sqlite://
(sqlite3.OperationalError) no such column: job_role
[SQL: SELECT COUNT(DISTINCT job_role) AS unique_roles
FROM employees;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Explanation

This query counts the number of different job roles present
in the employees table.

COUNT(DISTINCT job_role) first removes duplicate job roles
and then counts only the unique values.

## Why DISTINCT is necessary

Without DISTINCT, COUNT(job_role) would count all rows,
including repeated job roles.

DISTINCT ensures that each job role is counted only once,
giving the correct number of unique roles.

# Question 6

Write a query to retrieve students who scored between 60 and 80 marks.

Rewrite the same query using BETWEEN.

In [ ]:
%%sql
DROP TABLE IF EXISTS students;

CREATE TABLE students (
    id INT,
    name TEXT,
    marks INT
);

 * sqlite://
Done.
Done.

[]

In [ ]:
%%sql
INSERT INTO students (id, name, marks) VALUES
(1, 'Amit', 75),
(2, 'Riya', 82),
(3, 'Rahul', 60),
(4, 'Neha', 55),
(5, 'Karan', 68),
(6, 'Pooja', 80);

 * sqlite://
6 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM students;

 * sqlite://
Done.

[(1, 'Amit', 75),
 (2, 'Riya', 82),
 (3, 'Rahul', 60),
 (4, 'Neha', 55),
 (5, 'Karan', 68),
 (6, 'Pooja', 80)]

# Query Without BETWEEN

In [ ]:
%%sql
SELECT *
FROM students
WHERE marks >= 60 AND marks <= 80;

 * sqlite://
Done.

[(1, 'Amit', 75), (3, 'Rahul', 60), (5, 'Karan', 68), (6, 'Pooja', 80)]

# Query Using BETWEEN

In [ ]:
%%sql
SELECT *
FROM students
WHERE marks BETWEEN 60 AND 80;

 * sqlite://
Done.

[(1, 'Amit', 75), (3, 'Rahul', 60), (5, 'Karan', 68), (6, 'Pooja', 80)]

# Explanation

Both queries retrieve students whose marks fall within the range of 60 to 80.

• The first query uses comparison operators (>= and <=).

• The second query uses the BETWEEN operator.

BETWEEN is inclusive, meaning it includes both boundary values (60 and 80).

Using BETWEEN makes the query shorter and easier to read.

# Question 7.

Write a query to display employees whose commission is NULL.

Explain the correct way to check NULL values in SQL.

In [ ]:
%%sql
SELECT *
FROM employees
WHERE commission IS NULL;

 * sqlite://
Done.

[('Amit', 30000, 'IT', None),
 ('Rahul', 40000, 'IT', None),
 ('Karan', 35000, 'IT', None)]

# Explanation

In SQL, NULL represents missing or unknown values.

To check NULL values, we cannot use the equality operator (=).
Instead, we must use:

• IS NULL → to check missing values  
• IS NOT NULL → to check non-missing values  

This is because NULL does not behave like a normal value,
so comparisons like commission = NULL will not work.

# Question 8.

Write a query to increase the salary of employees in the “IT” department by 10%.

Explain how arithmetic operations are handled in SQL.

In [ ]:
%%sql
UPDATE employees
SET salary = salary * 1.10
WHERE department = 'IT';

 * sqlite://
3 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM employees;

 * sqlite://
Done.

[('Amit', 33000, 'IT', None),
 ('Riya', 50000, 'HR', 5000),
 ('Rahul', 44000, 'IT', None),
 ('Neha', 60000, 'Finance', 7000),
 ('Karan', 38500, 'IT', None)]

# Explanation

This query increases the salary of employees in the IT department by 10%.

• salary * 1.10 increases the value by 10%
• WHERE department = 'IT' ensures only IT employees are updated

## How arithmetic operations work in SQL

SQL supports arithmetic operators similar to programming languages:

'+'  → Addition  
'-'  → Subtraction  
'*'  → Multiplication  
/  → Division  

These operations are performed directly on column values
and applied row by row.

SQL evaluates expressions first and then updates or returns
the computed results.

# Question 9.

Write a query to delete records of students who scored less than 40 marks.

What precaution should be taken before executing DELETE?

In [ ]:
%%sql
DELETE FROM students
WHERE marks < 40;

 * sqlite://
0 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM students;

 * sqlite://
Done.

[(1, 'Amit', 75),
 (2, 'Riya', 82),
 (3, 'Rahul', 60),
 (4, 'Neha', 55),
 (5, 'Karan', 68),
 (6, 'Pooja', 80)]

# Explanation

This query deletes all student records where marks are less than 40.

The WHERE clause ensures that only the specified rows are removed.
Without WHERE, all rows in the table would be deleted.

# Question 10.

Write a query to find employees who earn more than the average
salary of their department (without using joins).

Explain the logic of the subquery.

In [ ]:
%%sql
SELECT employee_name, department, salary
FROM employees e
WHERE salary > (
    SELECT AVG(salary)
    FROM employees
    WHERE department = e.department
);

 * sqlite://
Done.

[('Rahul', 'IT', 44000)]

# Explanation

This query uses a correlated subquery to compare each employee’s
salary with the average salary of their department.

## Logicمة Let's explain the logic

1. The outer query selects each employee record.

2. For each row, the subquery calculates the average salary
   of employees in the same department:
   WHERE department = e.department

3. The salary of the current employee is compared with
   the calculated department average.

4. Only employees whose salary is greater than their
   department’s average are returned.

## Why it is called a correlated subquery

The subquery depends on the outer query (e.department),
so it runs once for each row.